
### :robot: Terraform Report
---
##### Plan: `5` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_alloydb_cluster.default will be created
  + resource "google_alloydb_cluster" "default" {
      + backup_source          = (known after apply)
      + cluster_id             = "alloydb-cluster"
      + cluster_type           = "PRIMARY"
      + continuous_backup_info = (known after apply)
      + database_version       = (known after apply)
      + deletion_policy        = "DEFAULT"
      + effective_annotations  = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + encryption_info        = (known after apply)
      + id                     = (known after apply)
      + location               = "us-central1"
      + migration_source       = (known after apply)
      + name                   = (known after apply)
      + project                = "maestro-intelligence"
      + reconciling            = (known after apply)
      + state                  = (known after apply)
      + subscription_type      = "TRIAL"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + trial_metadata         = (known after apply)
      + uid                    = (known after apply)

      + automated_backup_policy (known after apply)

      + continuous_backup_config (known after apply)

      + initial_user {
          + password = (sensitive value)
          + user     = "testuser"
        }

      + network_config {
          + network = (known after apply)
        }
    }

  # google_compute_firewall.allow_internal will be created
  + resource "google_compute_firewall" "allow_internal" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-internal"
      + network            = "vpc-maestro"
      + priority           = 65534
      + project            = "maestro-intelligence"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.0.0.0/24",
        ]

      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "udp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # google_compute_network.main will be created
  + resource "google_compute_network" "main" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "vpc-maestro"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "maestro-intelligence"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # google_compute_subnetwork.main will be created
  + resource "google_compute_subnetwork" "main" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "subnet-maestro"
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "maestro-intelligence"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range (known after apply)
    }

  # google_project_service.project_services["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "maestro-intelligence"
      + service                    = "secretmanager.googleapis.com"

      + timeouts {
          + create = "5m"
          + update = "10m"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#12278371116`](https://github.com/lessthan3/personalization/actions/runs/12278371116) - commit df9f50af874a9a76f7d83969e21948762480e144
